// WINDOW

// window.innerWidth - ширина области содержимого окна браузера.
// window.innerHeight - высота области содержимого окна браузера.
// window.outerWidth - внешняя ширина браузера, включая все элементы интерфейса.
// window.outerHeight - внешняя высота браузера, включая все элементы интерфейса.

// window.pageXOffset - число пикселей, на которое документ был прокручен по горизонтали.
// window.pageYOffset - число пикселей, на которое документ был прокручен по вертикали.

// все выше перечисленные свойства доступны только для чтения.




// window.scrollBy() - прокручивает страницу к заданным координатам;
window.scrollBy(0, 100); // прокрутить страницу на 0 пикселей по горизонтали и 100 по вертикали

// window.scrollTo() - прокручивает страницу на заданное количество координат;
window.scrollTo(0, 100); // прокрутить страницу к позиции 0 пикселей по горизонтали и 100 по вертикали